# YOLOv12m with DINOv3 DualP0P3 Integration - P0 Preprocessing + P3 Backbone Enhancement
# Architecture: Input -> DINO3Preprocessor -> YOLOv12 -> DINO3(P3) -> Head
# Optimized dual enhancement targeting P0 input and P3 backbone levels

nc: 80  # number of classes
scale: m  # force medium scale

scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # YOLOv12n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.50, 0.50, 1024]   # YOLOv12s summary: 225 layers, 11166560 parameters, 11166544 gradients,  29.7 GFLOPs
  m: [0.67, 0.75, 768]    # YOLOv12m summary: 295 layers, 21172000 parameters, 21171984 gradients,  48.5 GFLOPs
  l: [1.00, 1.00, 512]    # YOLOv12l summary: 365 layers, 43691520 parameters, 43691504 gradients,  86.9 GFLOPs
  x: [1.00, 1.25, 512]    # YOLOv12x summary: 365 layers, 68229648 parameters, 68229632 gradients, 135.4 GFLOPs

# P0 Preprocessing layer - DINO3 processes input before YOLOv12
preprocess:
  - [0, 1, DINO3Preprocessor, ['dinov3_vitb16', True, 3]]  # Input -> Enhanced input (3 channels)

backbone:
  # [from, repeats, module, args] - YOLOv12m backbone with DINO at P3
  # YOLOv12m channel progression with 0.75 width scaling: 3→48→96→192→192→384→384→384→768→768
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 (3→48 channels with m scaling: 64*0.75=48)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 1-P2/4 (48→96 channels with m scaling: 128*0.75=96)
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 (96→192 channels with m scaling: 256*0.75=192)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3-P3/8 (192→192 channels with m scaling: 256*0.75=192)
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4: Standard P3 (192→384 channels with m scaling: 512*0.75=384)
  
  # DINO integration at P3 level - maintain exact same channel count for YOLOv12m
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 384]]  # 5: DINO enhanced P3 (384→384 channels)
  
  # Continue standard YOLOv12m backbone 
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16 (384→384 channels with m scaling: 512*0.75=384)
  - [-1, 4, A2C2f, [512, True, 4]]  # 7: Standard P4 (384→384 channels with m scaling: 512*0.75=384)
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32 (384→768 channels with m scaling: 1024*0.75=768)
  - [-1, 4, A2C2f, [1024, True, 1]]  # 9: Standard P5 (768→768 channels with m scaling: 1024*0.75=768)

# YOLOv12m head architecture (adjusted for P3 DINO integration)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (768→768 channels)
  - [[-1, 7], 1, Concat, [1]] # 11: cat P5 + P4 (768 + 384 = 1152 channels)
  - [-1, 2, A2C2f, [512, False, -1]] # 12: (1152 → 384 channels with m scaling: 512*0.75=384)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (384→384 channels)
  - [[-1, 5], 1, Concat, [1]] # 14: cat with enhanced P3 (384 + 384 = 768 channels)
  - [-1, 2, A2C2f, [256, False, -1]] # 15: P3/8-small (768 → 192 channels with m scaling: 256*0.75=192)

  - [-1, 1, Conv, [256, 3, 2]] # 16: (192 → 192 channels with m scaling: 256*0.75=192)
  - [[-1, 12], 1, Concat, [1]] # 17: cat head P4 (192 + 384 = 576 channels)
  - [-1, 2, A2C2f, [512, False, -1]] # 18: P4/16-medium (576 → 384 channels with m scaling: 512*0.75=384)

  - [-1, 1, Conv, [512, 3, 2]] # 19: (384 → 384 channels with m scaling: 512*0.75=384)
  - [[-1, 9], 1, Concat, [1]] # 20: cat head P5 (384 + 768 = 1152 channels) 
  - [-1, 2, C3k2, [1024, True]] # 21: P5/32-large (1152 → 768 channels with m scaling: 1024*0.75=768)

  - [[15, 18, 21], 1, Detect, [nc]] # 22: Detect(P3=192, P4=384, P5=768)