# YOLOv12s with DINOv3 DualP0P3 Integration - P0 Preprocessing + P3 Backbone Enhancement
# Architecture: Input -> DINO3Preprocessor -> YOLOv12 -> DINO3(P3) -> Head
# Optimized dual enhancement targeting P0 input and P3 backbone levels

nc: 80  # number of classes
scale: s  # force small scale

scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # YOLOv12n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.50, 0.50, 1024]   # YOLOv12s summary: 225 layers, 11166560 parameters, 11166544 gradients,  29.7 GFLOPs
  m: [0.67, 0.75, 768]    # YOLOv12m summary: 295 layers, 21172000 parameters, 21171984 gradients,  48.5 GFLOPs
  l: [1.00, 1.00, 512]    # YOLOv12l summary: 365 layers, 43691520 parameters, 43691504 gradients,  86.9 GFLOPs
  x: [1.00, 1.25, 512]    # YOLOv12x summary: 365 layers, 68229648 parameters, 68229632 gradients, 135.4 GFLOPs

backbone:
  # [from, repeats, module, args] - DualP0P3: P0 Preprocessing + P3 Backbone Enhancement  
  # YOLOv12s channel progression with 0.5 width scaling: 3→32→64→128→128→256→256→256→512→512
  - [-1, 1, DINO3Preprocessor, ['dinov3_vitb16', True, 3]]  # 0: P0 Input preprocessing (3→3 channels)
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P1/2 (3→32 channels with s scaling: 64*0.5=32)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 2-P2/4 (32→64 channels with s scaling: 128*0.5=64)
  - [-1, 3, C3k2, [256, False, 0.25]]  # 3 (64→128 channels with s scaling: 256*0.5=128)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 4-P3/8 (128→128 channels with s scaling: 256*0.5=128)
  - [-1, 6, C3k2, [512, False, 0.25]]  # 5: Standard P3 (128→256 channels with s scaling: 512*0.5=256)
  
  # DINO integration at P3 level - maintain exact same channel count for YOLOv12s
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', True, 256]]  # 6: DINO enhanced P3 (256→256 channels)
  
  # Continue standard YOLOv12s backbone 
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16 (256→256 channels with s scaling: 512*0.5=256)
  - [-1, 6, A2C2f, [512, True, 4]]  # 8: Standard P4 (256→256 channels with s scaling: 512*0.5=256)
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32 (256→512 channels with s scaling: 1024*0.5=512)
  - [-1, 6, A2C2f, [1024, True, 1]]  # 10: Standard P5 (512→512 channels with s scaling: 1024*0.5=512)

# YOLOv12s head architecture (adjusted for P0+P3 DINO integration)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 (512→512 channels)
  - [[-1, 8], 1, Concat, [1]] # 12: cat P5 + P4 (512 + 256 = 768 channels)
  - [-1, 3, A2C2f, [512, False, -1]] # 13: (768 → 256 channels with s scaling: 512*0.5=256)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14 (256→256 channels)
  - [[-1, 6], 1, Concat, [1]] # 15: cat with enhanced P3 (256 + 256 = 512 channels)
  - [-1, 3, A2C2f, [256, False, -1]] # 16: P3/8-small (512 → 128 channels with s scaling: 256*0.5=128)

  - [-1, 1, Conv, [256, 3, 2]] # 17: (128 → 128 channels with s scaling: 256*0.5=128)
  - [[-1, 13], 1, Concat, [1]] # 18: cat head P4 (128 + 256 = 384 channels)
  - [-1, 3, A2C2f, [512, False, -1]] # 19: P4/16-medium (384 → 256 channels with s scaling: 512*0.5=256)

  - [-1, 1, Conv, [512, 3, 2]] # 20: (256 → 256 channels with s scaling: 512*0.5=256)
  - [[-1, 10], 1, Concat, [1]] # 21: cat head P5 (256 + 512 = 768 channels) 
  - [-1, 3, C3k2, [1024, True]] # 22: P5/32-large (768 → 512 channels with s scaling: 1024*0.5=512)

  - [[16, 19, 22], 1, Detect, [nc]] # 23: Detect(P3=128, P4=256, P5=512)